// assembler1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <stdio.h>

int main(int argc, const char * argv[]) 
{
	int number = 0;
	printf("Enter number: ");
	scanf_s("%d", &number);
	
	int last = 0;
	int last2 = 0;

	__asm
	{
	mov ecx, 10
	xor edx, edx
	mov eax,[number]

	div ecx
	mov[last], edx

	xor edx, edx
	div ecx
	mov[last2], edx
	}

	printf("Last : %d\n", last);
	printf("Last2: %d\n", last2);

	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
